DiffusiveMixing/Resolution_80/Case3/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.00003535533905932738 0.00003535533905932738 0)
	(0.00003535533905932738 -0.00003535533905932738 0)
	(0.001 0.0009292893218813453 0)
	(0.0009292893218813453 0.001 0)
	(0.00003535533905932738 0.0020353553390593275 0)
	(-0.00003535533905932738 0.0019646446609406726 0)
	(0.0009646446609406725 0.0011060660171779823 0)
	(0.001106066017177982 0.0009646446609406728 0)
	(0.0019292893218813452 0 0)
	(0.002 0.00007071067811865485 0)
	(0.002 0.0018585786437626903 0)
	(0.0018585786437626903 0.002 0)
	(0.002070710678118655 0 0)
	(0.0029646446609406726 0.0008939339828220176 0)
	(0.002893933982822018 0.0009646446609406727 0)
	(0.0021414213562373097 0.002 0)
	(0.0030353553390593275 0.0011060660171779823 0)
	(0.0031060660171779823 0.0010353553390593274 0)
	(0.0038585786437626904 2.168404344971009e-19 0)
	(0.004 0.0001414213562373097 0)
	(0.004 0.0019292893218813452 0)
	(0.003929289321881345 0.002 0)
	(0.00414142135623731 0 0)
	(0.0050353553390593275 0.0008939339828220179 0)
	(0.004893933982822018 0.0010353553390593274 0)
	(0.004070710678118655 0.002 0)
	(0.004964644660940673 0.0011060660171779823 0)
	(0.005106066017177982 0.0009646446609406728 0)
	(0.005929289321881345 -1.0842021724855044e-19 0)
	(0.006 0.00007071067811865485 0)
	(0.006 0.0018585786437626901 0)
	(0.00585857864376269 0.002 0)
	(0.006070710678118655 -6.776263578034403e-21 0)
	(0.007 0.0009292893218813451 0)
	(0.006893933982822018 0.0009646446609406726 0)
	(0.00614142135623731 0.002 0)
	(0.007035355339059328 0.0011060660171779823 0)
	(0.007070710678118655 0.001 0)
	(0.007964644660940674 -0.00003535533905932738 0)
	(0.008035355339059327 0.00003535533905932738 0)
	(0.008035355339059327 0.0019646446609406726 0)
	(0.007964644660940674 0.0020353553390593275 0)
	(0.002 -0.00007071067811865485 0)
	(0.002 0.0021414213562373097 0)
	(0.004 -0.0001414213562373096 0)
	(0.004 0.002070710678118655 0)
	(0.006 -0.0000707106781186548 0)
	(0.006 0.0021414213562373097 0)
	(-0.00003535533905932738 0.00003535533905932738 0.0001)
	(0.00003535533905932738 -0.00003535533905932738 0.0001)
	(0.001 0.0009292893218813453 0.0001)
	(0.0009292893218813453 0.001 0.0001)
	(0.00003535533905932738 0.0020353553390593275 0.0001)
	(-0.00003535533905932738 0.0019646446609406726 0.0001)
	(0.0009646446609406725 0.0011060660171779823 0.0001)
	(0.001106066017177982 0.0009646446609406728 0.0001)
	(0.0019292893218813452 0 0.0001)
	(0.002 0.00007071067811865485 0.0001)
	(0.002 0.0018585786437626903 0.0001)
	(0.0018585786437626903 0.002 0.0001)
	(0.002070710678118655 0 0.0001)
	(0.0029646446609406726 0.0008939339828220176 0.0001)
	(0.002893933982822018 0.0009646446609406727 0.0001)
	(0.0021414213562373097 0.002 0.0001)
	(0.0030353553390593275 0.0011060660171779823 0.0001)
	(0.0031060660171779823 0.0010353553390593274 0.0001)
	(0.0038585786437626904 2.168404344971009e-19 0.0001)
	(0.004 0.0001414213562373097 0.0001)
	(0.004 0.0019292893218813452 0.0001)
	(0.003929289321881345 0.002 0.0001)
	(0.00414142135623731 0 0.0001)
	(0.0050353553390593275 0.0008939339828220179 0.0001)
	(0.004893933982822018 0.0010353553390593274 0.0001)
	(0.004070710678118655 0.002 0.0001)
	(0.004964644660940673 0.0011060660171779823 0.0001)
	(0.005106066017177982 0.0009646446609406728 0.0001)
	(0.005929289321881345 -1.0842021724855044e-19 0.0001)
	(0.006 0.00007071067811865485 0.0001)
	(0.006 0.0018585786437626901 0.0001)
	(0.00585857864376269 0.002 0.0001)
	(0.006070710678118655 -6.776263578034403e-21 0.0001)
	(0.007 0.0009292893218813451 0.0001)
	(0.006893933982822018 0.0009646446609406726 0.0001)
	(0.00614142135623731 0.002 0.0001)
	(0.007035355339059328 0.0011060660171779823 0.0001)
	(0.007070710678118655 0.001 0.0001)
	(0.007964644660940674 -0.00003535533905932738 0.0001)
	(0.008035355339059327 0.00003535533905932738 0.0001)
	(0.008035355339059327 0.0019646446609406726 0.0001)
	(0.007964644660940674 0.0020353553390593275 0.0001)
	(0.002 -0.00007071067811865485 0.0001)
	(0.002 0.0021414213562373097 0.0001)
	(0.004 -0.0001414213562373096 0.0001)
	(0.004 0.002070710678118655 0.0001)
	(0.006 -0.0000707106781186548 0.0001)
	(0.006 0.0021414213562373097 0.0001)
);

blocks (
	hex (0 1 2 3 48 49 50 51) (80 400 1) simpleGrading (1 1 1)
	hex (4 5 3 6 52 53 51 54) (80 400 1) simpleGrading (1 1 1)
	hex (7 2 8 9 55 50 56 57) (80 400 1) simpleGrading (1 1 1)
	hex (6 7 10 11 54 55 58 59) (80 400 1) simpleGrading (1 1 1)
	hex (9 12 13 14 57 60 61 62) (80 400 1) simpleGrading (1 1 1)
	hex (15 10 14 16 63 58 62 64) (80 400 1) simpleGrading (1 1 1)
	hex (17 13 18 19 65 61 66 67) (80 400 1) simpleGrading (1 1 1)
	hex (16 17 20 21 64 65 68 69) (80 400 1) simpleGrading (1 1 1)
	hex (19 22 23 24 67 70 71 72) (80 400 1) simpleGrading (1 1 1)
	hex (25 20 24 26 73 68 72 74) (80 400 1) simpleGrading (1 1 1)
	hex (27 23 28 29 75 71 76 77) (80 400 1) simpleGrading (1 1 1)
	hex (26 27 30 31 74 75 78 79) (80 400 1) simpleGrading (1 1 1)
	hex (29 32 33 34 77 80 81 82) (80 400 1) simpleGrading (1 1 1)
	hex (35 30 34 36 83 78 82 84) (80 400 1) simpleGrading (1 1 1)
	hex (37 33 38 39 85 81 86 87) (80 400 1) simpleGrading (1 1 1)
	hex (36 37 40 41 84 85 88 89) (80 400 1) simpleGrading (1 1 1)
	hex (7 6 3 2 55 54 51 50) (80 80 1) simpleGrading (1 1 1)
	hex (12 9 8 42 60 57 56 90) (80 80 1) simpleGrading (1 1 1)
	hex (11 10 15 43 59 58 63 91) (80 80 1) simpleGrading (1 1 1)
	hex (17 16 14 13 65 64 62 61) (80 80 1) simpleGrading (1 1 1)
	hex (22 19 18 44 70 67 66 92) (80 80 1) simpleGrading (1 1 1)
	hex (21 20 25 45 69 68 73 93) (80 80 1) simpleGrading (1 1 1)
	hex (27 26 24 23 75 74 72 71) (80 80 1) simpleGrading (1 1 1)
	hex (32 29 28 46 80 77 76 94) (80 80 1) simpleGrading (1 1 1)
	hex (31 30 35 47 79 78 83 95) (80 80 1) simpleGrading (1 1 1)
	hex (37 36 34 33 85 84 82 81) (80 80 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 2 49 50)
			(3 0 51 48)
			(5 3 53 51)
			(6 4 54 52)
			(2 8 50 56)
			(9 7 57 55)
			(7 10 55 58)
			(11 6 59 54)
			(12 13 60 61)
			(14 9 62 57)
			(10 14 58 62)
			(16 15 64 63)
			(13 18 61 66)
			(19 17 67 65)
			(17 20 65 68)
			(21 16 69 64)
			(22 23 70 71)
			(24 19 72 67)
			(20 24 68 72)
			(26 25 74 73)
			(23 28 71 76)
			(29 27 77 75)
			(27 30 75 78)
			(31 26 79 74)
			(32 33 80 81)
			(34 29 82 77)
			(30 34 78 82)
			(36 35 84 83)
			(33 38 81 86)
			(39 37 87 85)
			(37 40 85 88)
			(41 36 89 84)
			(8 42 56 90)
			(42 12 90 60)
			(15 43 63 91)
			(43 11 91 59)
			(18 44 66 92)
			(44 22 92 70)
			(25 45 73 93)
			(45 21 93 69)
			(28 46 76 94)
			(46 32 94 80)
			(35 47 83 95)
			(47 31 95 79)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 48 49)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 52 53)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(38 39 86 87)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(40 41 88 89)
		);
	}
);